app/controllers/heros_controller.rb

SELECT "heros".* FROM "heros"
---
  def index
    @heros = Hero.all

INSERT INTO "heros" ("name", "power", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Zeus"], ["power", "Rayos"], ["created_at", "2016-07-14 17:48:32.745247"], ["updated_at", "2016-07-14 17:48:32.745247"]]
---
  def create
    @hero = Hero.new(hero_params)

    if @hero.save

SELECT  "heros".* FROM "heros" WHERE "heros"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "heros" SET "power" = $1, "updated_at" = $2 WHERE "heros"."id" = $3  [["power", "Muchos Rayos"], ["updated_at", "2016-07-19 21:51:26.479513"], ["id", 4]]
---
  def update
    @hero = Hero.find(params[:id])

    if @hero.update(hero_params)

DELETE FROM "heros" WHERE "heros"."id" = $1  [["id", 5]]
---
  def destroy
    @hero.destroy

SELECT  "heros".* FROM "heros" WHERE "heros"."id" = $1 LIMIT 1  [["id", 5]]
---
    def set_hero
      @hero = Hero.find(params[:id])